
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ТекущаяДата = НачалоГода(Дата);
	КонецГода = КонецГода(Дата);
	Движения.ГрафикПредприятия.Записывать = Истина;
	
	Пока ТекущаяДата <= КонецГода Цикл
		
	Движение = Движения.ГрафикПредприятия.Добавить();
	Движение.Дата = ТекущаяДата;
	ДеньНедели = ДеньНедели(ТекущаяДата);
	Если ДеньНедели<= 5 Тогда 
	    Движение.РабочийДень = 1;
	Иначе 
		 Движение.РабочийДень = 0;
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДата + 24*3600;
	
	КонецЦикла;
	
КонецПроцедуры
